In [376]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

In [378]:
data = pd.read_csv(r"C:\Users\Chet\Documents\Messy data set.csv")

In [380]:
data.head(9)

     ID     Name         Age               Email    JoinDate    Salary
0     1    Alice          25   alice@example.com  2020-01-01     50000
1     2      Bob          30     bob@example.com  not a date     60000
2     2      Bob          30     bob@example.com  2020-02-01     60000
3     4  Charlie         NaN            charlie@  2020-03-01     70000
4     5    David  Twenty-two                 NaN  2020-04-01       NaN
5     6      Eve          45         eve@example  2020-05-01     90000
6     7    Frank          50  frank@@example.com  2020-06-01    100000
7     8    Grace          55   grace@example.com  2020-07-01  one lakh
8  nine    Heidi          60   heidi@example.com  2020.08.01    120000

####  Identify Missing Values

In [383]:
missing_data = data.isnull().sum()
print("Missing Data")
print(missing_data)

Missing Data
ID          3
Name        4
Age         4
Email       4
JoinDate    3
Salary      4
dtype: int64

In [385]:
data = data.replace('Twenty-two',22)

In [387]:
data = data.replace('nine',9)

In [389]:
data = data.replace('one lakh',100000)

In [391]:
data = data.replace('not a date',"NaN")

In [393]:
data = data.replace('2020.08.01',"2020-08-01")

In [395]:
data.head(10)

   ID     Name  Age               Email    JoinDate  Salary
0   1    Alice   25   alice@example.com  2020-01-01   50000
1   2      Bob   30     bob@example.com         NaN   60000
2   2      Bob   30     bob@example.com  2020-02-01   60000
3   4  Charlie  NaN            charlie@  2020-03-01   70000
4   5    David   22                 NaN  2020-04-01     NaN
5   6      Eve   45         eve@example  2020-05-01   90000
6   7    Frank   50  frank@@example.com  2020-06-01  100000
7   8    Grace   55   grace@example.com  2020-07-01  100000
8   9    Heidi   60   heidi@example.com  2020-08-01  120000
9  10      NaN   65      10@example.com  2020-09-01  130000

#### Imputing Missing values

In [398]:
from sklearn.impute import SimpleImputer

In [400]:
imputer = SimpleImputer(strategy='most_frequent')
imputer.fit(data[['JoinDate']])
data[['JoinDate']] = imputer.transform(data[['JoinDate']])

In [402]:
imputer = SimpleImputer(strategy = 'most_frequent')
imputer.fit(data[['Email']])
data [['Email']] = imputer.transform(data[['Email']])

In [403]:
imputer = SimpleImputer(strategy = 'most_frequent')
imputer.fit(data[['Name']])
data [['Name']] = imputer.transform(data[['Name']])

In [406]:
data = data.replace('nine',9)

In [408]:
data.head(10)

   ID     Name  Age               Email    JoinDate  Salary
0   1    Alice   25   alice@example.com  2020-01-01   50000
1   2      Bob   30     bob@example.com         NaN   60000
2   2      Bob   30     bob@example.com  2020-02-01   60000
3   4  Charlie  NaN            charlie@  2020-03-01   70000
4   5    David   22     bob@example.com  2020-04-01     NaN
5   6      Eve   45         eve@example  2020-05-01   90000
6   7    Frank   50  frank@@example.com  2020-06-01  100000
7   8    Grace   55   grace@example.com  2020-07-01  100000
8   9    Heidi   60   heidi@example.com  2020-08-01  120000
9  10      Bob   65      10@example.com  2020-09-01  130000

#### Checking datatype

In [411]:
print(data.dtypes)

ID          object
Name        object
Age         object
Email       object
JoinDate    object
Salary      object
dtype: object

#### Removing Value

In [414]:
unique_values = data['Age'].unique()

In [416]:
print("Unique values in 'Age':", unique_values)

Unique values in 'Age': ['25' '30' nan 22 '45' '50' '55' '60' '65']

#### Assigning data type

In [419]:
data['Age'] = data['Age'].astype(float)

In [421]:
data.head()

  ID     Name   Age              Email    JoinDate Salary
0  1    Alice  25.0  alice@example.com  2020-01-01  50000
1  2      Bob  30.0    bob@example.com         NaN  60000
2  2      Bob  30.0    bob@example.com  2020-02-01  60000
3  4  Charlie   NaN           charlie@  2020-03-01  70000
4  5    David  22.0    bob@example.com  2020-04-01    NaN

####  Dealing with duplicates

In [424]:
duplicates = data.duplicated()
print(data[duplicates]['Age'])

11   NaN
12   NaN
Name: Age, dtype: float64

In [426]:
data.drop_duplicates(inplace=True)
data

     ID     Name   Age               Email    JoinDate  Salary
0     1    Alice  25.0   alice@example.com  2020-01-01   50000
1     2      Bob  30.0     bob@example.com         NaN   60000
2     2      Bob  30.0     bob@example.com  2020-02-01   60000
3     4  Charlie   NaN            charlie@  2020-03-01   70000
4     5    David  22.0     bob@example.com  2020-04-01     NaN
5     6      Eve  45.0         eve@example  2020-05-01   90000
6     7    Frank  50.0  frank@@example.com  2020-06-01  100000
7     8    Grace  55.0   grace@example.com  2020-07-01  100000
8     9    Heidi  60.0   heidi@example.com  2020-08-01  120000
9    10      Bob  65.0      10@example.com  2020-09-01  130000
10  NaN      Bob   NaN     bob@example.com  2020-01-01     NaN

####  Sorting data

In [429]:
sorted_data = data.sort_values(by='Age', ascending=False)
sorted_data

     ID     Name   Age               Email    JoinDate  Salary
9    10      Bob  65.0      10@example.com  2020-09-01  130000
8     9    Heidi  60.0   heidi@example.com  2020-08-01  120000
7     8    Grace  55.0   grace@example.com  2020-07-01  100000
6     7    Frank  50.0  frank@@example.com  2020-06-01  100000
5     6      Eve  45.0         eve@example  2020-05-01   90000
1     2      Bob  30.0     bob@example.com         NaN   60000
2     2      Bob  30.0     bob@example.com  2020-02-01   60000
0     1    Alice  25.0   alice@example.com  2020-01-01   50000
4     5    David  22.0     bob@example.com  2020-04-01     NaN
3     4  Charlie   NaN            charlie@  2020-03-01   70000
10  NaN      Bob   NaN     bob@example.com  2020-01-01     NaN

#### Boolean filtering

In [432]:
filtered_data = data[data['Age'] > 25]
filtered_data

   ID   Name   Age               Email    JoinDate  Salary
1   2    Bob  30.0     bob@example.com         NaN   60000
2   2    Bob  30.0     bob@example.com  2020-02-01   60000
5   6    Eve  45.0         eve@example  2020-05-01   90000
6   7  Frank  50.0  frank@@example.com  2020-06-01  100000
7   8  Grace  55.0   grace@example.com  2020-07-01  100000
8   9  Heidi  60.0   heidi@example.com  2020-08-01  120000
9  10    Bob  65.0      10@example.com  2020-09-01  130000

#### Is, In

In [435]:
data = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie','Frank'],
    'Salary': ['High', 'Low', 'Medium','Large']
})

In [437]:
filtered_data = data[data['Salary'].isin(['High', 'Medium','Large'])]
filtered_data

      Name  Salary
0    Alice    High
2  Charlie  Medium
3    Frank   Large

####  Loc and Iloc

In [440]:
data = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'Charlie', 'Bob'],
    'Salary': [50000, 60000, 50000, 70000, 60000]})

In [442]:
data.loc[data['Name'] == 'Bob']

  Name  Salary
1  Bob   60000
4  Bob   60000

In [444]:
data.loc[data['Salary'] > 50000, ['Salary']]

   Salary
1   60000
3   70000
4   60000

In [446]:
 data.iloc[0:4]

      Name  Salary
0    Alice   50000
1      Bob   60000
2    Alice   50000
3  Charlie   70000

In [448]:
data.iloc[0:4, 1:3]
data

      Name  Salary
0    Alice   50000
1      Bob   60000
2    Alice   50000
3  Charlie   70000
4      Bob   60000

## values

In [451]:
data['Salary'].value_counts()

Salary
50000    2
60000    2
70000    1
Name: count, dtype: int64

## Describe

In [454]:
data.describe()

             Salary
count      5.000000
mean   58000.000000
std     8366.600265
min    50000.000000
25%    50000.000000
50%    60000.000000
75%    60000.000000
max    70000.000000

## Group by

In [457]:
grouped_var = data.groupby('Name')['Salary'].mean()
print(grouped_var)

Name
Alice      50000.0
Bob        60000.0
Charlie    70000.0
Name: Salary, dtype: float64

## pivot table

In [460]:

data = pd.DataFrame({
    'ID' : [1,2,3,4,5],
    'Age' : [25,35,40,35,42],
    'Name': ['Alice', 'Bob', 'Charlie', 'David','Eve']
})


pivot_table = data.pivot_table(
    index='Name',
    values=['ID', 'Age'],
    aggfunc={'ID': 'mean', 'Age': 'mean'}
)

print(pivot_table)

          Age   ID
Name
Alice    25.0  1.0
Bob      35.0  2.0
Charlie  40.0  3.0
David    35.0  4.0
Eve      42.0  5.0

## Cross tab

In [463]:
data = pd.DataFrame({
    'DATA': ['1', '1', '2', '2', '3', '1', '3'],
    'DATA1': ['A', 'B', 'A', 'B', 'A', 'A', 'A']
})


cross_tab = pd.crosstab(data['DATA'],data['DATA1'],
    margins=True,                
    normalize='index')           


print(cross_tab)

DATA1         A         B
DATA
1      0.666667  0.333333
2      0.500000  0.500000
3      1.000000  0.000000
All    0.714286  0.285714

####  Combining and condition

In [472]:
data = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [25, 35, 45, 28],
    'Salary': [50000, 60000, 70000, 48000]})

In [474]:
data = data[(data['Age'] > 30) | (data['Salary'] < 50000)]
data

      Name  Age  Salary
1      Bob   35   60000
2  Charlie   45   70000
3    Diana   28   48000

## 14 Joining

In [ ]:
data = pd.DataFrame({
    'ID': [1,2,3,4],
    'name': ['Alice', 'Bob', 'Charlie', 'Bob'],
    'salary': [50000, 60000, 70000, 60000]
})

In [ ]:
data2 = pd.DataFrame({
    'order_id': [2, 3, 4, 5],
    'ID': [1, 2, 3, 4],
    'order_date': ['2024-05-01', '2024-05-03', '2024-05-05', '2024-05-07']
    
})

In [ ]:
joined_data = pd.merge(data,data2, on='ID', how='inner')
joined_data.head()

## 15 concatenating

In [476]:
data = pd.DataFrame({
    'ID': [1,2,3,4],
    'name': ['Alice', 'Bob', 'Charlie', 'Bob'],
    'salary': [50000, 60000, 70000, 60000]
})

In [478]:
data2 = pd.DataFrame({
   'ID': [5,6,7,8],
   'salary': [50000, 60000, 70000, 60000]
    
})

In [480]:
concatenated_data = pd.concat([data, data2])
concatenated_data.head()

   ID     name  salary
0   1    Alice   50000
1   2      Bob   60000
2   3  Charlie   70000
3   4      Bob   60000
0   5      NaN   50000

In [482]:
data.head(10)

   ID     name  salary
0   1    Alice   50000
1   2      Bob   60000
2   3  Charlie   70000
3   4      Bob   60000